In [3]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [4]:
data = pd.read_csv('Week_8_Q&A_dataset - Sheet1.csv')

In [5]:
data.head()

   Gender Test preparation  Total Marks
0    male             none           14
1  female             none           28
2  female             none           18
3  female             none           48
4  female             none           21

In [6]:
data['Gender'].value_counts()

female    16
male      12
Name: Gender, dtype: int64

In [7]:
female_data = data[data['Gender'] == 'female']
male_data = data[data['Gender'] == 'male']

In [8]:
print(female_data)
print(male_data)

    Gender Test preparation  Total Marks
1   female             none           28
2   female             none           18
3   female             none           48
4   female             none           21
5   female        completed           40
7   female             none           12
14  female             none           41
15  female             none           13
16  female        completed           48
17  female             none           45
22  female             none           41
23  female             none           27
24  female             none           27
25  female             none           38
26  female        completed           50
27  female        completed           43
   Gender Test preparation  Total Marks
0    male             none           14
6    male             none           30
8    male             none           18
9    male             none           24
10   male        completed           44
11   male             none           23
12   male        completed           43
13   male             none           28
18   male             none           47
19   male             none           36
20   male             none           14
21   male        completed           44

In [9]:
female_data.sort_values(by=['Total Marks'],ascending=False)

    Gender Test preparation  Total Marks
26  female        completed           50
3   female             none           48
16  female        completed           48
17  female             none           45
27  female        completed           43
14  female             none           41
22  female             none           41
5   female        completed           40
25  female             none           38
1   female             none           28
23  female             none           27
24  female             none           27
4   female             none           21
2   female             none           18
15  female             none           13
7   female             none           12

In [10]:
female_data.describe()

       Total Marks
count    16.000000
mean     33.750000
std      12.865976
min      12.000000
25%      25.500000
50%      39.000000
75%      43.500000
max      50.000000

In [11]:
male_data.describe()

       Total Marks
count    12.000000
mean     30.416667
std      12.168950
min      14.000000
25%      21.750000
50%      29.000000
75%      43.250000
max      47.000000

In [12]:
#Females scored higher on an average

In [13]:
female_testprepdata = data[data['Test preparation'] == 'completed']
male_testprepdata = data[data['Test preparation'] == 'completed']

In [14]:
print(female_testprepdata)

    Gender Test preparation  Total Marks
5   female        completed           40
10    male        completed           44
12    male        completed           43
16  female        completed           48
21    male        completed           44
26  female        completed           50
27  female        completed           43

In [15]:
data['Test preparation'].value_counts()

none         21
completed     7
Name: Test preparation, dtype: int64

In [16]:
# Trying to analyse the data via hypothesis testing

In [23]:
import scipy.stats as stats
stats.ttest_ind(data['Total Marks'][data['Gender'] == "male"],
               data['Total Marks'][data['Gender'] == "female"],alternative='two-sided')

Ttest_indResult(statistic=-0.6940885268848668, pvalue=0.4937822317960763)

In [24]:
#since the p value is greater than .05, we can assume the latter hypthesis
# meaning Scores are comparitively different for males and females

In [27]:
stats.ttest_ind(female_testprepdata['Total Marks'],male_testprepdata['Total Marks'],alternative='greater')

Ttest_indResult(statistic=0.0, pvalue=0.5)